epccs/AVR-Dx_DFP/edc/AVR128DA32.PIC
        <edc:SFRDef edc:_addr="0x51" edc:access="-----nnn" edc:cname="VREGCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLPCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLPCTRL">
              <edc:SFRFieldDef edc:cname="PMODE" edc:desc="Performance Mode" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="" edc:when="(field &amp; 0x7) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x52" edc:offset="0xE"/>
        <edc:SFRDef edc:_addr="0x60" edc:access="n----nnn" edc:cname="MCLKCTRLA" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="clock select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="OSCHF" edc:desc="Internal high-frequency oxcillator" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="Internal 32.768 kHz oscillator" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="32.768 kHz crystal oscillator" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="EXTCLK" edc:desc="External clock" edc:when="(field &amp; 0x7) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CLKOUT" edc:desc="System clock out" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x61" edc:access="---nnnnn" edc:cname="MCLKCTRLB" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="PEN" edc:desc="Prescaler enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDIV" edc:desc="Prescaler division" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="2X" edc:desc="2X" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="4X" edc:desc="4X" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="8X" edc:desc="8X" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="16X" edc:desc="16X" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="32X" edc:desc="32X" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="64X" edc:desc="64X" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="6X" edc:desc="6X" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="10X" edc:desc="10X" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="12X" edc:desc="12X" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="24X" edc:desc="24X" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="48X" edc:desc="48X" edc:when="(field &amp; 0xF) == 0x0C"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x62" edc:access="-------n" edc:cname="MCLKLOCK" edc:impl="0x1" edc:nzwidth="0x8" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="LOCKEN" edc:desc="lock ebable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x63" edc:access="--nnnnnn" edc:cname="MCLKSTATUS" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="SOSC" edc:desc="System Oscillator changing" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSCHFS" edc:desc="High frequency oscillator status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSC32KS" edc:desc="32KHz oscillator status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XOSC32KS" edc:desc="32.768 kHz Crystal Oscillator status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTS" edc:desc="External Clock status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLLS" edc:desc="PLL oscillator status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x64" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0x68" edc:access="n-nnnn-n" edc:cname="OSCHFCTRLA" edc:impl="0xBD" edc:mclr="00001100" edc:nzwidth="0x8" edc:por="00001100" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="AUTOTUNE" edc:desc="Autotune" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FREQSEL" edc:desc="Frequency select" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="1M" edc:desc="1 MHz system clock" edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="2M" edc:desc="2 MHz system clock" edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="3M" edc:desc="3 MHz system clock" edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="4M" edc:desc="4 MHz system clock (default)" edc:when="(field &amp; 0xF) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="8M" edc:desc="8 MHz system clock" edc:when="(field &amp; 0xF) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="12M" edc:desc="12 MHz system clock" edc:when="(field &amp; 0xF) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="16M" edc:desc="16 MHz system clock" edc:when="(field &amp; 0xF) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="20M" edc:desc="20 MHz system clock" edc:when="(field &amp; 0xF) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="24M" edc:desc="24 MHz system clock" edc:when="(field &amp; 0xF) == 0x9"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x69" edc:access="nnnnnnnn" edc:cname="OSCHFTUNE" edc:nzwidth="0x8" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="TUNE" edc:desc="Tune" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x6A" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0x70" edc:access="n--n--nn" edc:cname="PLLCTRLA" edc:impl="0x93" edc:nzwidth="0x8" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="MULFAC" edc:desc="Multiplication factor" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="PLL is disabled" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="2x" edc:desc="2 x multiplication factor" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="3x" edc:desc="3 x multiplication factor" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="4x" edc:desc="4 x multiplication factor" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="SOURCE" edc:desc="Source" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x71" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0x78" edc:access="n-------" edc:cname="OSC32KCTRLA" edc:impl="0x80" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CLKCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run standby" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
