epccs/AVR-Dx_DFP/edc/AVR128DA32.PIC
        <edc:SFRDef edc:_addr="0x60E" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x60F" edc:access="nnnnnnnn" edc:cname="TEMP" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="TEMP" edc:desc="Temporary" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x610" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RES" edc:nzwidth="0x10" ltx:memberofperipheral="ADC0"/>
        <edc:SFRDef edc:_addr="0x612" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINLT" edc:nzwidth="0x10" ltx:memberofperipheral="ADC0"/>
        <edc:SFRDef edc:_addr="0x614" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINHT" edc:nzwidth="0x10" ltx:memberofperipheral="ADC0"/>
        <edc:AdjustPoint edc:_addr="0x616" edc:offset="0x6A"/>
        <edc:SFRDef edc:_addr="0x680" edc:access="nn-nnnnn" edc:cname="CTRLA" edc:impl="0xDF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYSMODE" edc:desc="Hysteresis Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No hysteresis" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SMALL" edc:desc="Small hysteresis" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Medium hysteresis" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="LARGE" edc:desc="Large hysteresis" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="POWER" edc:desc="Power profile" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PROFILE0" edc:desc="Power profile 0, lowest consumption and highest response time." edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="PROFILE1" edc:desc="Power profile 1" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="PROFILE2" edc:desc="Power profile 2" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="PROFILE3" edc:desc="Power profile 3" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTEN" edc:desc="Output Pad Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x681" edc:access="------nn" edc:cname="CTRLB" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="WINSEL" edc:desc="Window selection mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Window function disabled" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="UPSEL1" edc:desc="Select ACn+1 as upper limit in window compare." edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="UPSEL2" edc:desc="Select ACn+2 as upper limit in window compare." edc:when="(field &amp; 0x3) == 0x2"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x682" edc:access="nnnnnnnn" edc:cname="MUXCTRL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Input MUX Selection" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="AINN0" edc:desc="Negative Pin 0" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="AINN1" edc:desc="Negative Pin 1" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="AINN2" edc:desc="Negative Pin 2" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DACREF" edc:desc="DAC Reference" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Input MUX Selection" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="AINP0" edc:desc="Positive Pin 0" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="AINP1" edc:desc="Positive Pin 1" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="AINP2" edc:desc="Positive Pin 2" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="AINP3" edc:desc="Positive Pin 3" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INITVAL" edc:desc="AC Output Initial Value" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Output initialized to 0" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Output initialized to 1" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INVERT" edc:desc="Invert AC Output" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x683" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x685" edc:access="nnnnnnnn" edc:cname="DAC0REF" edc:mclr="11111111" edc:nzwidth="0x8" edc:por="11111111" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="DACREF" edc:desc="DACREF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
