epccs/AVR-Dx_DFP/edc/AVR128DA32.PIC
        <edc:AdjustPoint edc:_addr="0xB9A" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0xB9E" edc:access="-----n-n" edc:cname="DBGCTRL" edc:impl="0x5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug run" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FAULTDET" edc:desc="Fault detection" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xB9F" edc:offset="0x3"/>
        <edc:SFRDef edc:_addr="0xBA2" edc:access="rrrrrrrrrrrrrrrr" edc:cname="CAPTUREA" edc:nzwidth="0x10" ltx:memberofperipheral="TCD0"/>
        <edc:SFRDef edc:_addr="0xBA4" edc:access="rrrrrrrrrrrrrrrr" edc:cname="CAPTUREB" edc:nzwidth="0x10" ltx:memberofperipheral="TCD0"/>
        <edc:AdjustPoint edc:_addr="0xBA6" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xBA8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMPASET" edc:nzwidth="0x10" ltx:memberofperipheral="TCD0"/>
        <edc:SFRDef edc:_addr="0xBAA" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMPACLR" edc:nzwidth="0x10" ltx:memberofperipheral="TCD0"/>
        <edc:SFRDef edc:_addr="0xBAC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMPBSET" edc:nzwidth="0x10" ltx:memberofperipheral="TCD0"/>
        <edc:SFRDef edc:_addr="0xBAE" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CMPBCLR" edc:nzwidth="0x10" ltx:memberofperipheral="TCD0"/>
        <edc:AdjustPoint edc:_addr="0xBB0" edc:offset="0x351"/>
        <edc:SFRDef edc:_addr="0xF01" edc:access="nnnnnnnn" edc:cname="REVID" edc:nzwidth="0x8" ltx:memberofperipheral="SYSCFG"/>
        <edc:AdjustPoint edc:_addr="0xF02" edc:offset="0x16"/>
        <edc:SFRDef edc:_addr="0xF18" edc:access="nnnnnnnn" edc:cname="OCDMCTRL" edc:nzwidth="0x8" ltx:memberofperipheral="SYSCFG"/>
        <edc:SFRDef edc:_addr="0xF19" edc:access="-------n" edc:cname="OCDMSTATUS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SYSCFG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCFG">
              <edc:SFRFieldDef edc:cname="OCDMR" edc:desc="OCD Message Read" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF1A" edc:offset="0xE6"/>
        <edc:SFRDef edc:_addr="0x1000" edc:access="-nnnnnnn" edc:cname="CTRLA" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x7">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x7F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="NOOP" edc:desc="No Operation" edc:when="(field &amp; 0x7F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FLWR" edc:desc="Flash Write" edc:when="(field &amp; 0x7F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="FLPER" edc:desc="Flash Page Erase" edc:when="(field &amp; 0x7F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER2" edc:desc="Flash Multi-Page Erase 2 pages" edc:when="(field &amp; 0x7F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER4" edc:desc="Flash Multi-Page Erase 4 pages" edc:when="(field &amp; 0x7F) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER8" edc:desc="Flash Multi-Page Erase 8 pages" edc:when="(field &amp; 0x7F) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER16" edc:desc="Flash Multi-Page Erase 16 pages" edc:when="(field &amp; 0x7F) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="FLMPER32" edc:desc="Flash Multi-Page Erase 32 pages" edc:when="(field &amp; 0x7F) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="EEWR" edc:desc="EEPROM Write" edc:when="(field &amp; 0x7F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="EEERWR" edc:desc="EEPROM Erase and Write" edc:when="(field &amp; 0x7F) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="EEBER" edc:desc="EEPROM Byte Erase" edc:when="(field &amp; 0x7F) == 0x18"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER2" edc:desc="EEPROM Multi-Byte Erase 2 bytes" edc:when="(field &amp; 0x7F) == 0x19"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER4" edc:desc="EEPROM Multi-Byte Erase 4 bytes" edc:when="(field &amp; 0x7F) == 0x1A"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER8" edc:desc="EEPROM Multi-Byte Erase 8 bytes" edc:when="(field &amp; 0x7F) == 0x1B"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER16" edc:desc="EEPROM Multi-Byte Erase 16 bytes" edc:when="(field &amp; 0x7F) == 0x1C"/>
                <edc:SFRFieldSemantic edc:cname="EEMBER32" edc:desc="EEPROM Multi-Byte Erase 32 bytes" edc:when="(field &amp; 0x7F) == 0x1D"/>
                <edc:SFRFieldSemantic edc:cname="CHER" edc:desc="Chip Erase Command" edc:when="(field &amp; 0x7F) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="EECHER" edc:desc="EEPROM Erase Command" edc:when="(field &amp; 0x7F) == 0x30"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1001" edc:access="n-nn-nnn" edc:cname="CTRLB" edc:impl="0xB7" edc:mclr="00110000" edc:nzwidth="0x8" edc:por="00110000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="APPCODEWP" edc:desc="Application Code Write Protect" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOOTRP" edc:desc="Boot Read Protect" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="APPDATAWP" edc:desc="Application Data Write Protect" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FLMAP" edc:desc="Flash Mapping in Data space" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="SECTION0" edc:desc="Flash section 0, 0 - 32KB" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="SECTION1" edc:desc="Flash section 1, 32 - 64KB" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="SECTION2" edc:desc="Flash section 2, 64 - 96KB" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="SECTION3" edc:desc="Flash section 3, 96 - 128KB" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FLMAPLOCK" edc:desc="Flash Mapping Lock" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1002" edc:access="-rrr--rr" edc:cname="STATUS" edc:impl="0x73" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="FBUSY" edc:desc="Flash busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEBUSY" edc:desc="EEPROM busy" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Write error" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="NOERROR" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ILLEGALCMD" edc:desc="Write command not selected" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="ILLEGALSADDR" edc:desc="Write to section not allowed" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="DOUBLESELECT" edc:desc="Selecting new write command while write command already seleted" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="ONGOINGPROG" edc:desc="Starting a new programming operation before previous is completed" edc:when="(field &amp; 0x7) == 0x4"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
