epccs/AVR-Dx_DFP/edc/AVR128DA32.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PF2"/>
      <edc:VirtualPin edc:name="AIN18" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT5" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT3_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C1" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT5" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WOC2D0" edc:ppsfunction="TCD0_ALT2" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART2" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="XY34" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF3"/>
      <edc:VirtualPin edc:name="AIN19" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT3_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C1" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT5" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WOD3D0" edc:ppsfunction="TCD0_ALT2" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART2" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="XY35" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF4"/>
      <edc:VirtualPin edc:name="AIN20" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART2_ALT" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="WO0B0" edc:ppsfunction="TCB0_ALT" ltx:memberofperipheral="TCB0"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT5" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY36" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF5"/>
      <edc:VirtualPin edc:name="AIN21" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART2_ALT" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="WO0B1" edc:ppsfunction="TCB1_ALT" ltx:memberofperipheral="TCB1"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT5" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY37" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF6"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="RESET" edc:ppsfunction="OTHER" ltx:memberofperipheral="RSTCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="UPDI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0"/>
      <edc:VirtualPin edc:name="CLKI" edc:ppsfunction="CLKCTRL" ltx:memberofperipheral="CLKCTRL"/>
      <edc:VirtualPin edc:name="LUT0_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY0" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="LUT0_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY1" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT0_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C0" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO0B0" edc:ppsfunction="TCB0" ltx:memberofperipheral="TCB0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="XY2" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
